Repository: Leviidev/Husk
Catalog: src/app/Husk/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: %@ Built-in StikJIT needs iOS 26, LocalDevVPN, and a pairing file, which Husk can make itself on iOS 27.
zh_hans: %@内置 StikJIT 需要 iOS 26、LocalDevVPN 和配对文件；在 iOS 27 上 Husk 可以自己生成配对文件。

source: %@ Orientation and resolution apply the next time the game starts, and a game already running in this session needs Husk closed and opened again.
zh_hans: %@方向和分辨率会在游戏下次启动时生效；如果游戏已在本次会话中运行，需要先完全关闭 Husk 再打开。

source: %@ is compressed inside its bundle, which Husk cannot unpack yet.
zh_hans: %@ 在它的捆绑包内是压缩的，Husk 目前无法解压。

source: %@ is gone from Android.
zh_hans: %@ 已从 Android 中移除。

source: %@ is ready to launch.
zh_hans: %@ 已可以启动。

source: %@ was started in this session, and a game cannot be unloaded once it has started. Close Husk completely and open it again to run %@.
zh_hans: %@ 已在本次会话中启动过，而游戏一旦启动就无法卸载。请完全关闭 Husk 再打开，即可运行 %@。

source: %@. Open the Android screen and check it is running, then try again.
zh_hans: %@。请打开 Android 屏幕确认它仍在运行，然后重试。

source: %lld apps
zh_hans: %lld 个应用

source: %lld controllers
zh_hans: %lld 个控制器

source: %lld files
zh_hans: %lld 个文件

source: %lld files sent
zh_hans: 已发送 %lld 个文件

source: %lld min · first boot takes 5–15 min
zh_hans: %lld 分钟 · 首次启动需要 5–15 分钟

source: %lld of them use tricks the older loader could not handle; the native runtime handles those too, except for optional anti-tamper code, which it leaves out.
zh_hans: 其中 %lld 个使用了旧加载器无法处理的技巧；原生运行时也能处理，只是会略过可选的反篡改代码。

source: %lld%% · %@ · %@ elapsed
zh_hans: %lld%% · %@ · 已用 %@

source: %llu frame(s) drawn · native runtime
zh_hans: 已绘制 %llu 帧 · 原生运行时

source: 1 file
zh_hans: 1 个文件

source: 1 pixel per point. Fastest.
zh_hans: 每点 1 像素。最快。

source: 1.5 pixels per point.
zh_hans: 每点 1.5 像素。

source: 2 pixels per point. The default.
zh_hans: 每点 2 像素。默认值。

source: A %@ game. It runs through Husk's native runtime, which loads its %lld arm64 libraries itself.
zh_hans: 这是一个 %@ 游戏。它通过 Husk 的原生运行时运行，由运行时自行加载它的 %lld 个 arm64 库。

source: A change takes effect the next time Husk opens.
zh_hans: 更改将在下次打开 Husk 时生效。

source: A custom resolution sets the shape itself, so this does nothing while it is on. Type a wide size for landscape.
zh_hans: 自定义分辨率本身就已决定屏幕形状，因此开启它时这一项不起作用。横屏请填写较宽的尺寸。

source: A new Android image is available
zh_hans: 有新的 Android 系统镜像可用

source: A new pre-booted snapshot is available
zh_hans: 有新的预启动快照可用

source: APK installed
zh_hans: APK 已安装

source: APK or bundle
zh_hans: APK 或捆绑包

source: APKs install from the Library's + button or from the Files tab. Split sets — a base APK plus its config pieces — must be picked together; installing the base alone fails on missing native libraries.
zh_hans: APK 可以从应用库的 + 按钮或「文件」标签页安装。分包 APK——基础 APK 加上它的配置分片——必须一起选择；只安装基础 APK 会因为缺少原生库而失败。

source: ATTEMPT LOG
zh_hans: 尝试日志

source: About
zh_hans: 关于

source: Accent Colour
zh_hans: 强调色

source: Active Repositories
zh_hans: 已启用的仓库

source: Add
zh_hans: 添加

source: Add APK
zh_hans: 添加 APK

source: Add App
zh_hans: 添加应用

source: Add Source
zh_hans: 添加源

source: Add an APK and it will be installed into the Android runtime, then appear here with its own icon.
zh_hans: 添加一个 APK，它会被安装到 Android 运行环境中，然后带着自己的图标出现在这里。

source: Adding %@…
zh_hans: 正在添加 %@…

source: Adding %lld APKs…
zh_hans: 正在添加 %lld 个 APK…

source: Adds a sound device. Android cannot be saved while this is on, so every launch boots from cold.
zh_hans: 添加一个声音设备。开启后无法保存 Android，因此每次启动都是冷启动。

source: Adds a sound device. While it is attached Android cannot be saved — QEMU refuses to snapshot a machine with one — so every launch boots from cold. Turning it on or off costs a cold boot either way.
zh_hans: 添加一个声音设备。只要它处于附加状态，Android 就无法保存——QEMU 拒绝对带有声音设备的机器做快照——所以每次启动都是冷启动。无论开启还是关闭，代价都是一次冷启动。

source: Adds about 2 GB to the first download. It was captured on the software renderer, so it is not used on GPU — which cold-boots once and then saves its own.
zh_hans: 首次下载会多出约 2 GB。该快照是在软件渲染器上采集的，因此在 GPU 模式下不会使用——GPU 模式会先冷启动一次，然后保存自己的快照。

source: All
zh_hans: 全部

source: Almost worth the wait
zh_hans: 差不多值得等

source: Always
zh_hans: 始终

source: Always this look.
zh_hans: 始终保持这一外观。

source: Android Is Not Running
zh_hans: Android 未在运行

source: Android and Translation Layer games need JIT, which on iOS only an attached debugger can grant. StikJIT is built into Husk and is the recommended way: it turns JIT on from inside the app, with no computer and no other app. StikDebug and TrollStore work too.
zh_hans: Android 和翻译层游戏都需要 JIT，而在 iOS 上只有附加的调试器才能授予它。StikJIT 已内置于 Husk，也是推荐方式：它无需电脑、无需其他应用，直接在应用内开启 JIT。StikDebug 和 TrollStore 同样可行。

source: Android and Translation Layer games need JIT. StikJIT, built into Husk, turns it on without a computer.
zh_hans: Android 和翻译层游戏需要 JIT。内置于 Husk 的 StikJIT 无需电脑即可开启。

source: Android apps, on your iPhone
zh_hans: 在 iPhone 上运行 Android 应用

source: Android apps, on your iPhone.
zh_hans: 在 iPhone 上运行 Android 应用。

source: Android cannot reshape a screen once it is running, so a landscape game on a portrait screen gets letterboxed into a band and looks tiny. Creating it landscape is the only way it can fill it — portrait apps are letterboxed instead. Costs one cold boot.
zh_hans: Android 一旦运行就无法改变屏幕形状，因此横屏游戏在竖屏上会被压成一条加黑边的窄带，看起来很小。只有开局就建成横屏才能填满屏幕——反过来竖屏应用会被加黑边。代价是一次冷启动。

source: Android draws on the real GPU through Metal — about four times the frame rate. This is the default.
zh_hans: Android 通过 Metal 在真实 GPU 上绘制——帧率约为四倍。这是默认设置。

source: Android installs it from where it already is — nothing is copied.
zh_hans: Android 会就地安装它——不会复制任何内容。

source: Android is booting…
zh_hans: Android 正在启动…

source: Android is locked. Open the Android screen, unlock it, and try again.
zh_hans: Android 已锁定。请打开 Android 屏幕解锁后重试。

source: Android is locked. Unlock it and try again.
zh_hans: Android 已锁定。请解锁后重试。

source: Android is ready
zh_hans: Android 已就绪

source: Android libraries it needs
zh_hans: 它需要的 Android 库

source: Android reaches the internet through a virtual ethernet card on QEMU's own network. Nothing on your phone's network can see the guest, and the guest cannot see it.
zh_hans: Android 通过 QEMU 自有网络上的虚拟网卡访问互联网。你手机所在的网络看不到客户机，客户机也看不到它。

source: Android will boot from cold once, then save a new one.
zh_hans: Android 会先冷启动一次，然后保存一个新的快照。

source: Android's native code expects things of the processor and of memory that only the phone can answer -- above all, whether a library's code can run with its data writable right beside it. Enable JIT first, or the memory checks are skipped. The results go to the console too.
zh_hans: Android 的原生代码对处理器和内存有特定要求，只有这台手机能给出答案——其中最要紧的是，一个库的代码能否在紧邻其可写数据的情况下运行。请先启用 JIT，否则会跳过内存检查。结果也会写入控制台。

source: Another game is already loaded
zh_hans: 已加载另一个游戏

source: App Icon
zh_hans: 应用图标

source: App Info
zh_hans: 应用信息

source: App by Levi
zh_hans: 作者 Levi

source: Appearance
zh_hans: 外观

source: Apps
zh_hans: 应用

source: Attach the sound device
zh_hans: 附加声音设备

source: Automatic
zh_hans: 自动

source: Automatic follows the system appearance — light, dark and tinted. The others pin one look. iOS shows its own confirmation after a change; that alert cannot be turned off.
zh_hans: 「自动」跟随系统外观——浅色、深色和色调化。其余选项会固定一种外观。更改后 iOS 会显示自己的确认提示；该提示无法关闭。

source: Automatic offers the controller for games that cannot be played without one (Unreal Engine games), when no real controller is connected. Always offers it for any game that understands one. A paired controller is always used.
zh_hans: 「自动」会在没有连接实体控制器时，为必须用控制器的游戏（虚幻引擎游戏）提供屏幕控制器；对任何识别控制器的游戏则始终提供。已配对的控制器始终优先生效。

source: Back to Husk
zh_hans: 返回 Husk

source: Boots the guest as soon as Husk opens, once JIT is available. Off means you start it yourself.
zh_hans: JIT 可用时，Husk 一打开就启动客户机。关闭则需你手动启动。

source: Boots the guest as soon as Husk opens, when JIT is available.
zh_hans: JIT 可用时，Husk 一打开就启动客户机。

source: Both sides must be between 240 and 2560.
zh_hans: 两边都必须介于 240 和 2560 之间。

source: Browse Files
zh_hans: 浏览文件

source: Build
zh_hans: 构建

source: Built-in JIT is available only on a physical device.
zh_hans: 内置 JIT 仅在真机上可用。

source: Built-in JIT is unavailable inside LiveContainer. Use StikDebug instead.
zh_hans: 在 LiveContainer 内无法使用内置 JIT，请改用 StikDebug。

source: Built-in JIT is unavailable.
zh_hans: 内置 JIT 不可用。

source: Built-in JIT needs iOS 26 or later. Use StikDebug instead.
zh_hans: 内置 JIT 需要 iOS 26 或更高版本，请改用 StikDebug。

source: Built-in StikJIT
zh_hans: 内置 StikJIT

source: Built-in StikJIT needs LocalDevVPN and a pairing file, which Husk can make itself on iOS 27.
zh_hans: 内置 StikJIT 需要 LocalDevVPN 和配对文件；在 iOS 27 上 Husk 可以自己生成配对文件。

source: Cancel
zh_hans: 取消

source: Cancel pairing
zh_hans: 取消配对

source: Cannot load
zh_hans: 无法加载

source: Change JIT Setup
zh_hans: 更改 JIT 设置

source: Check setup
zh_hans: 检查设置

source: Checking LocalDevVPN and the Developer Disk Image…
zh_hans: 正在检查 LocalDevVPN 和开发者磁盘映像…

source: Checking…
zh_hans: 正在检查…

source: Choose another file
zh_hans: 选择其他文件

source: Choose pairing file
zh_hans: 选择配对文件

source: Clear Dark
zh_hans: 透明深色

source: Clear Light
zh_hans: 透明浅色

source: Close
zh_hans: 关闭

source: Connect LocalDevVPN
zh_hans: 连接 LocalDevVPN

source: Console
zh_hans: 控制台

source: Continue
zh_hans: 继续

source: Continue with the current pairing
zh_hans: 沿用当前配对继续

source: Controller
zh_hans: 控制器

source: Controls
zh_hans: 控制

source: Copy
zh_hans: 拷贝

source: Copy Package Name
zh_hans: 拷贝包名

source: Copying %@ — %lld%%
zh_hans: 正在拷贝 %@ — %lld%%

source: Could Not Load
zh_hans: 无法加载

source: Could not add %@: %@
zh_hans: 无法添加 %@：%@

source: Could not add the app
zh_hans: 无法添加该应用

source: Could not send %@: %@
zh_hans: 无法发送 %@：%@

source: Could not start — see the log
zh_hans: 无法启动——请查看日志

source: Could not uninstall
zh_hans: 无法卸载

source: Could not unpack the snapshot: %@
zh_hans: 无法解包快照：%@

source: Currently saved: %@.
zh_hans: 当前已保存：%@。

source: Custom
zh_hans: 自定义

source: Custom Colour
zh_hans: 自定义颜色

source: Custom resolution
zh_hans: 自定义分辨率

source: Dark
zh_hans: 深色

source: Data
zh_hans: 数据

source: Delete saved machine
zh_hans: 删除已保存的机器

source: Deleted the %@ machine. The next launch boots from cold.
zh_hans: 已删除 %@ 机器。下次启动将冷启动。

source: Deletes Husk's copy of the APKs. Anything installed in Android is untouched.
zh_hans: 删除 Husk 持有的 APK 副本。已安装进 Android 的内容不受影响。

source: Deletes what the game saved and downloaded here: saves, settings and caches. The game itself stays.
zh_hans: 删除游戏在此保存和下载的所有内容：存档、设置和缓存。游戏本身会保留。

source: Details
zh_hans: 详情

source: Developer Info
zh_hans: 开发者信息

source: Discover
zh_hans: 发现

source: Display
zh_hans: 显示

source: Done
zh_hans: 完成

source: Download
zh_hans: 下载

source: Download Android runtime
zh_hans: 下载 Android 运行环境

source: Download did not produce a disk image: %@
zh_hans: 下载没有得到磁盘映像：%@

source: Download pre-booted snapshot
zh_hans: 下载预启动快照

source: Downloading Android runtime
zh_hans: 正在下载 Android 运行环境

source: Downloading it replaces the Android system and its pre-booted snapshot (%@), and with them everything inside Android — installed apps included. A snapshot only restores against the image it was saved on, so the two cannot be updated separately.
zh_hans: 下载它会替换 Android 系统及其预启动快照（%@），同时替换 Android 内的全部内容——包括已安装的应用。快照只能在与保存它时相同的镜像上恢复，因此两者无法分开更新。

source: Downloading pre-booted Android
zh_hans: 正在下载预启动的 Android

source: Emulator
zh_hans: 模拟器

source: Enable JIT
zh_hans: 启用 JIT

source: Enable JIT with %@
zh_hans: 用 %@ 启用 JIT

source: Enable JIT with TrollStore
zh_hans: 用 TrollStore 启用 JIT

source: Enter it on this %@ to pair with Husk
zh_hans: 在这台 %@ 上输入它与 Husk 配对

source: Enter this code on your %@
zh_hans: 在你的 %@ 上输入此代码

source: Enter this code on your %@ to finish pairing.
zh_hans: 在你的 %@ 上输入此代码以完成配对。

source: Every pixel is drawn by the emulated CPU. Much slower, and only worth choosing if the GPU misbehaves.
zh_hans: 每个像素都由模拟的 CPU 绘制。慢得多，只有在 GPU 出问题时才值得选择。

source: Every pixel the screen has. Sharpest, and heaviest.
zh_hans: 屏幕的全部像素。最清晰，也最吃性能。

source: Fetching Repositories…
zh_hans: 正在获取仓库…

source: File sent
zh_hans: 文件已发送

source: Files
zh_hans: 文件

source: First run downloads Android and can take several minutes.
zh_hans: 首次运行需要下载 Android，可能要几分钟。

source: First time? See the setup, or use StikDebug or TrollStore instead
zh_hans: 第一次使用？查看设置向导，或改用 StikDebug、TrollStore

source: Follows the system: light, dark and tinted.
zh_hans: 跟随系统：浅色、深色和色调化。

source: Full HD — 1080 × 1920
zh_hans: 全高清 — 1080 × 1920

source: GPU machine
zh_hans: GPU 机器

source: Games
zh_hans: 游戏

source: Games and Android can run.
zh_hans: 游戏和 Android 都可以运行了。

source: General
zh_hans: 通用

source: Get
zh_hans: 获取

source: Get LocalDevVPN
zh_hans: 获取 LocalDevVPN

source: Gives Android a landscape screen, which games fill properly. Portrait apps get letterboxed instead.
zh_hans: 给 Android 一块横屏，游戏便能完整填满。竖屏应用则会被加黑边。

source: Guest image
zh_hans: 客户机镜像

source: HD — 720 × 1280
zh_hans: 高清 — 720 × 1280

source: Height
zh_hans: 高度

source: Hide
zh_hans: 隐藏

source: Hide log
zh_hans: 隐藏日志

source: Hide pad
zh_hans: 隐藏手柄

source: Hide the interface
zh_hans: 隐藏界面

source: High
zh_hans: 高

source: Home
zh_hans: 主屏幕

source: How it connects
zh_hans: 连接方式

source: How should Husk behave?
zh_hans: 你希望 Husk 如何工作？

source: How to Allow JIT
zh_hans: 如何允许 JIT

source: Husk could not announce itself on the local network. Check that Wi-Fi is on, then try again.
zh_hans: Husk 无法在本地网络上广播自己。请确认 Wi-Fi 已开启，然后重试。

source: Husk could not copy it: %@
zh_hans: Husk 无法复制它：%@

source: Husk could not open its pairing port.
zh_hans: Husk 无法打开配对端口。

source: Husk couldn't reach this device. Connect LocalDevVPN, then try again.
zh_hans: Husk 联系不上这台设备。请连接 LocalDevVPN 后重试。

source: Husk needs Local Network access to pair. Allow it in Settings › Apps › Husk, then try again.
zh_hans: Husk 需要本地网络权限才能配对。请在「设置 › 应用 › Husk」中允许，然后重试。

source: Husk needs its Android runtime — about 760 MB. Android itself is downloaded afterwards by the runtime.
zh_hans: Husk 需要它的 Android 运行环境——约 760 MB。Android 本身随后由运行环境下载。

source: Husk needs memory it can write and then execute, which on iOS takes an attached debugger. There are two ways to get it: a debugger that services trap requests, or a MAP_JIT mapping, which the kernel allows any debugged process. Either one is enough — which is available depends on the device and the iOS version, so Husk tests both rather than assuming.
zh_hans: Husk 需要既能写入又能执行的内存，而在 iOS 上这需要附加调试器。有两条路可走：由调试器响应陷阱请求，或使用 MAP_JIT 映射——内核对任何被调试的进程都允许它。两者有其一即可；哪一条可用取决于设备和 iOS 版本，因此 Husk 会实际测试而不是想当然。

source: Husk pairing code: %@
zh_hans: Husk 配对码：%@

source: Husk restores a saved machine instead of booting it, which takes seconds rather than minutes. The picture freezes while it writes. With this off, nothing saves by itself — including after an install.
zh_hans: Husk 会恢复已保存的机器而不是重新启动，只需几秒而不是几分钟。写入期间画面会冻结。关闭此项后不会有任何自动保存——安装之后也不会。

source: Husk runs a real Android system and opens APKs inside it. A few questions first — all of them can be changed later in Settings.
zh_hans: Husk 运行一个真正的 Android 系统，并在其中打开 APK。先问几个问题——全都可以稍后在「设置」中更改。

source: Husk runs unmodified Android APKs in a real Android system on your iPhone. The console shows Husk's live log, the guest's serial output and QEMU's own output — the three files any problem here is diagnosed from.
zh_hans: Husk 在你的 iPhone 上运行真正的 Android 系统，并直接运行未经修改的 APK。控制台显示 Husk 的实时日志、客户机的串口输出和 QEMU 自身的输出——这里出现的任何问题都要靠这三个文件来诊断。

source: Husk turns the screen the way the game asks for.
zh_hans: Husk 按游戏的要求旋转屏幕。

source: Husk was marked as debugged when it opened, so JIT is on.
zh_hans: Husk 启动时已被标记为已调试，因此 JIT 已开启。

source: Husk will use StikDebug.
zh_hans: Husk 将使用 StikDebug。

source: Husk will use TrollStore.
zh_hans: Husk 将使用 TrollStore。

source: Husk's JIT helper (%@) could not be found: %@ Reinstall Husk.
zh_hans: 找不到 Husk 的 JIT 辅助程序（%@）：%@ 请重新安装 Husk。

source: Husk's JIT helper did not start. Reinstall Husk, and keep its app extensions if your sideloader asks.
zh_hans: Husk 的 JIT 辅助程序没有启动。请重新安装 Husk；如果你的侧载工具询问，请保留它的应用扩展。

source: Husk's JIT helper finished without an answer.
zh_hans: Husk 的 JIT 辅助程序结束时没有返回结果。

source: Husk's JIT helper is missing from this installation. Reinstall Husk, and keep its app extensions if your sideloader asks, or use StikDebug.
zh_hans: 这次安装中缺少 Husk 的 JIT 辅助程序。请重新安装 Husk；如果你的侧载工具询问，请保留它的应用扩展，或改用 StikDebug。

source: Husk's JIT helper stopped unexpectedly. Try again.
zh_hans: Husk 的 JIT 辅助程序意外停止。请重试。

source: Husk's JIT helper stopped: %@
zh_hans: Husk 的 JIT 辅助程序已停止：%@

source: Husk's JIT script is missing from this installation. Reinstall Husk.
zh_hans: 这次安装中缺少 Husk 的 JIT 脚本。请重新安装 Husk。

source: If JIT is not on when Android starts, Husk turns it on with the method you chose, or walks you through setting one up. You can change it any time in Settings › JIT & sideload.
zh_hans: 如果 Android 启动时 JIT 尚未开启，Husk 会用你选择的方式开启它，或带你完成设置。你可以随时在「设置 › JIT 与侧载」中更改。

source: Import
zh_hans: 导入

source: Import Files
zh_hans: 导入文件

source: Import a new pairing file
zh_hans: 导入新的配对文件

source: In Android's %@ folder.
zh_hans: 已放入 Android 的 %@ 文件夹。

source: Input
zh_hans: 输入

source: Install
zh_hans: 安装

source: Install %@?
zh_hans: 安装 %@？

source: Install APK
zh_hans: 安装 APK

source: Install an APK and it appears here. Split sets work too — pick every piece at once.
zh_hans: 安装一个 APK，它就会出现在这里。分包 APK 也可以——请一次选中所有分片。

source: Install failed
zh_hans: 安装失败

source: Install failed: %@
zh_hans: 安装失败：%@

source: Installed, but not saved
zh_hans: 已安装，但未保存

source: Installing %@…
zh_hans: 正在安装 %@…

source: Installing…
zh_hans: 正在安装…

source: Invalid URL
zh_hans: 无效的 URL

source: It is a landscape game: Husk turns the screen for it.
zh_hans: 这是横屏游戏：Husk 会为它旋转屏幕。

source: It opens as soon as Android answers.
zh_hans: Android 一有响应它就会打开。

source: It will be gone on the next launch.
zh_hans: 下次启动时它就会消失。

source: It's connected
zh_hans: 已连接

source: Its data goes with it. Save Android afterwards or the change is lost on the next launch.
zh_hans: 它的数据会一并删除。之后请保存 Android，否则这次更改会在下次启动时丢失。

source: Its own libraries link against these, and it does not carry them. Each is something the translation layer has to provide.
zh_hans: 它自己的库依赖这些库，而它并不自带。每一个都需要翻译层来提供。

source: JIT & sideload
zh_hans: JIT 与侧载

source: JIT allowed for apps
zh_hans: 已允许应用使用 JIT

source: JIT is on
zh_hans: JIT 已开启

source: JIT is on.
zh_hans: JIT 已开启。

source: Jailbreak (Dopamine)
zh_hans: 越狱（Dopamine）

source: Keep debugger attached
zh_hans: 保持调试器附加

source: Keep the network across saves
zh_hans: 保存时保留网络

source: Keep the screen on
zh_hans: 保持屏幕常亮

source: Landscape
zh_hans: 横屏

source: Landscape HD — 1280 × 720
zh_hans: 横屏高清 — 1280 × 720

source: Language
zh_hans: 语言

source: Last Used
zh_hans: 上次使用

source: Launch
zh_hans: 启动

source: Library
zh_hans: 应用库

source: Light
zh_hans: 浅色

source: Loaded: Native libraries loaded (no draw)
zh_hans: 已加载：原生库加载成功（没有绘制画面）

source: Loading libraries and starting the engine
zh_hans: 正在加载库并启动引擎

source: Loading the engine…
zh_hans: 正在加载引擎…

source: Loads arm64 native code into JIT memory on Apple Silicon and drives a NativeActivity lifecycle. Apps with Java/Dex require ART (milestone 2).
zh_hans: 在 Apple 芯片上把 arm64 原生代码加载进 JIT 内存，并驱动 NativeActivity 生命周期。含 Java/Dex 的应用需要 ART（第二阶段）。

source: Log
zh_hans: 日志

source: Logs
zh_hans: 日志

source: Low
zh_hans: 低

source: Manage Repositories
zh_hans: 管理仓库

source: Maps as it is
zh_hans: 可原样映射

source: Medium
zh_hans: 中

source: Method
zh_hans: 方式

source: Name
zh_hans: 名称

source: Names and icons come from Android's own launcher, which keeps the version it draws. Re-fetching throws away Husk's copies and asks again.
zh_hans: 名称和图标来自 Android 自己的桌面，而桌面会保留它绘制过的那一版。重新获取会丢弃 Husk 的副本并再问一次。

source: Native
zh_hans: 原生

source: Native runtime
zh_hans: 原生运行时

source: Nearly there
zh_hans: 就快好了

source: Needs JIT. StikJIT is built in — the recommended way.
zh_hans: 需要 JIT。StikJIT 已内置——这是推荐方式。

source: Needs loader work
zh_hans: 需要加载器处理

source: Negotiating with the JIT
zh_hans: 正在与 JIT 交涉

source: Network
zh_hans: 网络

source: Never
zh_hans: 从不

source: Never from Husk
zh_hans: 从未通过 Husk

source: No %@ machine is saved, so nothing was deleted.
zh_hans: 没有保存 %@ 机器，因此未删除任何内容。

source: No apps yet
zh_hans: 还没有应用

source: No jailbreak was found on this %@.
zh_hans: 在这台 %@ 上未发现越狱。

source: No, it has not frozen
zh_hans: 没有卡死，真的

source: Not now
zh_hans: 以后再说

source: Not started
zh_hans: 未启动

source: Not yet
zh_hans: 暂不支持

source: Nothing is saved, so Android boots from cold.
zh_hans: 没有已保存的内容，Android 将冷启动。

source: Now
zh_hans: 当前

source: OK
zh_hans: 好

source: Off by default. Husk detaches StikDebug as soon as the JIT region is held, because a debugger that iOS has suspended stops the whole app the next time it is needed. Turn this on only to collect StikDebug's own logs.
zh_hans: 默认关闭。一旦 JIT 区域到手，Husk 就会分离 StikDebug，因为被 iOS 挂起的调试器会在下次需要它时拖住整个应用。只有需要收集 StikDebug 自己的日志时才开启。

source: On a jailbroken device JIT is a setting. In Dopamine, turn on Allow JIT in Apps, then open Husk again.
zh_hans: 在已越狱的设备上，JIT 只是一项设置。请在 Dopamine 中打开「允许应用使用 JIT」，然后重新打开 Husk。

source: On-screen controller
zh_hans: 屏幕控制器

source: Opacity
zh_hans: 不透明度

source: Open
zh_hans: 打开

source: Open Console
zh_hans: 打开控制台

source: Open Settings
zh_hans: 打开设置

source: Open in Files
zh_hans: 在「文件」中打开

source: Opening…
zh_hans: 正在打开…

source: Orientation
zh_hans: 方向

source: Other Ways to Turn On JIT
zh_hans: 其他开启 JIT 的方式

source: Pad
zh_hans: 手柄

source: Pair again
zh_hans: 重新配对

source: Pair this device or import its pairing file first.
zh_hans: 请先与这台设备配对，或导入它的配对文件。

source: Paired on this %@.
zh_hans: 已在这台 %@ 上配对。

source: Paired on this device.
zh_hans: 已在本机配对。

source: Paired with Husk
zh_hans: 已与 Husk 配对

source: Pairing code %@
zh_hans: 配对码 %@

source: Pairing failed. Try again.
zh_hans: 配对失败。请重试。

source: Pairing failed: %@
zh_hans: 配对失败：%@

source: Pairing file imported.
zh_hans: 配对文件已导入。

source: Pairing finished, but Husk could not save the pairing file.
zh_hans: 配对已完成，但 Husk 无法保存配对文件。

source: Pairing timed out. Try again when you are ready to pair from Settings.
zh_hans: 配对超时。等你可以从「设置」配对时再试一次。

source: Pairing with Husk
zh_hans: 正在与 Husk 配对

source: Paste any F-Droid-compatible repository index URL.
zh_hans: 粘贴任意兼容 F-Droid 的仓库索引 URL。

source: Performance
zh_hans: 性能

source: Performance readout
zh_hans: 性能读数

source: Play
zh_hans: 开始游戏

source: Portrait
zh_hans: 竖屏

source: Prepare for awesomeness
zh_hans: 准备好大吃一惊

source: Preset
zh_hans: 预设

source: Presets
zh_hans: 预设

source: Re-fetch icons
zh_hans: 重新获取图标

source: Ready
zh_hans: 就绪

source: Ready to launch.
zh_hans: 可以启动了。

source: Reducing render size…
zh_hans: 正在降低渲染尺寸…

source: Refresh
zh_hans: 刷新

source: Refresh from Android
zh_hans: 从 Android 刷新

source: Refreshing…
zh_hans: 正在刷新…

source: Refused: Could not execute
zh_hans: 被拒绝：无法执行

source: Remove
zh_hans: 移除

source: Remove %@?
zh_hans: 移除 %@？

source: Removing %@…
zh_hans: 正在移除 %@…

source: Renderer
zh_hans: 渲染器

source: Repositories
zh_hans: 仓库

source: Rerun
zh_hans: 重新运行

source: Reset Developer Disk Image
zh_hans: 重置开发者磁盘映像

source: Reset Game Data
zh_hans: 重置游戏数据

source: Reset the data of %@?
zh_hans: 重置 %@ 的数据？

source: Resetting the Developer Disk Image cache…
zh_hans: 正在重置开发者磁盘映像缓存…

source: Resolution
zh_hans: 分辨率

source: Restart Husk to see the change.
zh_hans: 重新打开 Husk 即可看到更改。

source: Restoring full resolution…
zh_hans: 正在恢复完整分辨率…

source: Return to Husk to finish setting up JIT.
zh_hans: 返回 Husk 以完成 JIT 设置。

source: Rotate picture
zh_hans: 旋转画面

source: Run Translation Layer Attempt
zh_hans: 运行翻译层尝试

source: Run again
zh_hans: 再运行一次

source: Run checks
zh_hans: 运行检查

source: Running
zh_hans: 运行中

source: Running Attempt...
zh_hans: 正在运行尝试…
